## Create a full list of games id to name pair for games in both user-items and games metadata

- to be able to lookup item name by id when making recommendations

In [1]:
import pandas as pd
import numpy as np
import json

In [2]:
all_games_1 = pd.read_csv("../processed_data/all_games_id_name_pair.csv")

### Get all game id name pair in user items

In [3]:
with open('../data/australian_users_items'+'_fixed.json') as f:
    df_items = json.load(f)   
user_items = pd.json_normalize(data=df_items, 
                              record_path='items',
                              meta=['items_count','steam_id','user_id','user_url'])

In [4]:
game_id_to_name = user_items[["item_id", "item_name"]].copy()

In [5]:
game_id_to_name.item_id = game_id_to_name.item_id.astype(int)

In [6]:
game_id_to_name.drop_duplicates(inplace=True)
game_id_to_name

         item_id                                     item_name
0             10                                Counter-Strike
1             20                         Team Fortress Classic
2             30                                 Day of Defeat
3             40                            Deathmatch Classic
4             50                     Half-Life: Opposing Force
...          ...                                           ...
4913278   375450  NOBUNAGA'S AMBITION: Souzou SengokuRisshiden
5092969   353390                       Alienware Steam Machine
5105048   354280                                    ChaosTower
5119454   433920                 Aveyond 4: Shadow Of The Mist
5145725   485270                                 Arachnophobia

[10978 rows x 2 columns]

### Get all game id name pair in game metadata

In [7]:
games = pd.read_csv("../processed_data/games_metadata.csv")

In [8]:
game_id_to_name_2 = games[["id", "app_name"]].copy().rename(columns={'id':'item_id', 'app_name':'item_name'})
game_id_to_name_2

        item_id                 item_name
0      761140.0       Lost Summoner Kitty
1      643980.0                 Ironbound
2      670290.0   Real Pool 3D - Poolians
3      767400.0                   弹炸人2222
4      773570.0             Log Challenge
...         ...                       ...
32126  773640.0            Colony On Mars
32127  733530.0  LOGistICAL: South Africa
32128  610660.0             Russian Roads
32129  658870.0       EXIT 2 - Directions
32130  681550.0               Maze Run VR

[32131 rows x 2 columns]

### Combine two dataframes

In [9]:
all_games = game_id_to_name.append(game_id_to_name_2)

In [10]:
all_games.shape

(43109, 2)

In [11]:
all_games.drop_duplicates(inplace=True)

In [12]:
all_games[all_games.duplicated("item_id", keep=False)].sort_values(by="item_id")

         item_id                                 item_name
57815     1670.0          Iron Warriors: T-72 Tank Command
32030     1670.0        Iron Warriors: T - 72 Tank Command
236       1930.0                   Two Worlds Epic Edition
3288      1930.0                  Two Worlds: Epic Edition
32048     2100.0             Dark Messiah of Might & Magic
...          ...                                       ...
104832  521450.0                  Hunted: One Step too Far
21570   522490.0                        Carrie's Order Up!
104835  522490.0                         Carrie's Order Up
7260    522660.0  Snooker-online multiplayer snooker game!
556556  522660.0                              SnookerWorld

[2754 rows x 2 columns]

- There are a lot of item id with different item names, peeked the duplicates as above that the name are actually the same, just some formatting issue, so can relatively safe to drop duplicates, only keep the first one as item name.

In [13]:
all_games.drop_duplicates(subset="item_id", inplace=True)

In [14]:
all_games.drop_duplicates(inplace=True)

In [15]:
all_games

        item_id                  item_name
0          10.0             Counter-Strike
1          20.0      Team Fortress Classic
2          30.0              Day of Defeat
3          40.0         Deathmatch Classic
4          50.0  Half-Life: Opposing Force
...         ...                        ...
32126  773640.0             Colony On Mars
32127  733530.0   LOGistICAL: South Africa
32128  610660.0              Russian Roads
32129  658870.0        EXIT 2 - Directions
32130  681550.0                Maze Run VR

[33917 rows x 2 columns]

In [16]:
all_games.to_csv("../processed_data/all_games_id_name_pair.csv", index=False)